#

# Validando a melhor forma de usar o modelo no AWS Lambda

## Metodo 1

- Usando o joblib para carregar o modelo

In [26]:
import joblib
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split

In [27]:
%%time
model = joblib.load("model.joblib")

CPU times: total: 15.6 ms
Wall time: 15.4 ms

In [28]:
df = pd.read_csv("http://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [29]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [31]:
df.query('Embarked == "C"')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [9]:
target = "Survived"
ignore_cols = ["Name", "PassengerId", "Ticket", "Cabin"]
numeric_preds = list(set(df._get_numeric_data().columns) - set([target] +ignore_cols))
cat_preds = list(set(df.columns) - set([target] + ignore_cols + numeric_preds))

In [21]:
cat_preds

['Embarked', 'Sex']

In [23]:
df_prep = pd.concat([df[numeric_preds], df[[target]], pd.get_dummies(df[cat_preds], drop_first=True)], axis=1).fillna(0)
df_prep.sample(10)

,Pclass,SibSp,Age,Parch,Fare,Survived,Embarked_Q,Embarked_S,Sex_male
595,3,1,36.0,1,24.1500,0,False,True,True
465,3,0,38.0,0,7.0500,0,False,True,True
693,3,0,25.0,0,7.2250,0,False,False,True
333,3,2,16.0,0,18.0000,0,False,True,True
318,1,0,31.0,2,164.8667,1,False,True,False
427,2,0,19.0,0,26.0000,1,False,True,False
17,2,0,0.0,0,13.0000,1,False,True,True
391,3,0,21.0,0,7.7958,1,False,True,True
570,2,0,62.0,0,10.5000,1,False,True,True
51,3,0,21.0,0,7.8000,0,False,True,True

In [19]:
predictors = list(set(df_prep.columns) - set([target]))

In [ ]:
predictors

['Pclass',
 'SibSp',
 'Age',
 'Parch',
 'Fare',
 'Sex_male',
 'Embarked_Q',
 'Embarked_S']